org/Snormacs.org
#+title: Snormacs; The horribly bloated emacs configuration
* Snormacs?
Snormacs is my personal literate configuration of GNU's Emacs.
The reason I didn't choose Neovim at first is that I liked having
a GUI & a daemon. I also don't mind using LISP, as long ago I struggled
finding Neovim documentation for Lua.
** Features:
- EXWM Desktop (I stopped using this so it is unmaintained)
- Elpaca PKG Manager
- Calendar Setup (soon)
- LSP
- EVIL + GOD Mode
- ...

* Snormacs!
Alright to get started I will lay out some things first:
- *A.* I use NixOS so in the future there may be Nix-Related Changes
- *B.* The "~/.emacs.d/" PATH is very important and anything related to
  Emacs will be there. In my personal dotfiles I also use it to store
  files & other media. (.custom)
** Early Init:
Early Init is a file sourced by Emacs that by default is loaded before anything else.
This is important so we can enable the Elpaca PKG Manager to handle our
packages. I also remove a lot of unnecessary Emacs UI.
#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
  (setq gc-cons-threshold (* 50 1000 1000))
  (setq package-enable-at-startup nil)
  (setq make-backup-files nil)

  (defvar default-file-name-handler-alist file-name-handler-alist)
  (setq file-name-handler-alist nil)
  (setq frame-inhibit-implied-resize t)
  (advice-add #'x-apply-session-resources :override #'ignore)
  (setq desktop-restore-forces-onscreen nil)

  (push '(menu-bar-lines . 0) default-frame-alist)
  (push '(tool-bar-lines . 0) default-frame-alist)
  (push '(vertical-scroll-bars) default-frame-alist)
  (set-fringe-mode 10)

  (setq server-client-instructions nil)
  (provide 'early-init)
#+end_src
*** Oh shit...
As of now I have EVERYTHING in a single file (init.el).
This may change if my configuration becomes very large but for now
I'm just to lazy to move everything to other files. So yes all of these source
blocks from this section can all be found in ~/.emacs.d/init.el.
** The Body Of The Essay: (init.el)
**** Elpaca Bootstrap
Elpaca needs to install itself upon Snormacs' first startup.
This code will ensure elpaca is installed.
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (defvar elpaca-installer-version 0.5)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                :ref nil
                                :files (:defaults (:exclude "extensions"))
                                :build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (< emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                   ((zerop (call-process "git" nil buffer t "clone"
                                         (plist-get order :repo) repo)))
                   ((zerop (call-process "git" nil buffer t "checkout"
                                         (or (plist-get order :ref) "--"))))
                   (emacs (concat invocation-directory invocation-name))
                   ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                         "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                   ((require 'elpaca))
                   ((elpaca-generate-autoloads "elpaca" repo)))
              (kill-buffer buffer)
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (load "./elpaca-autoloads")))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))

  (elpaca elpaca-use-package
    (elpaca-use-package-mode)
    (setq elpaca-use-package-by-default t))
  (elpaca-wait)
#+end_src
**** Small Notice
If you've never used Emacs before just know that the "use-package" function is
a package and its the best shit ever. In caveman terms what use-package does is
"make emac fast". Use-package prevents loading in packages until they are needed
which pretty much is the reason all configurations over 300 lines aren't dogshit in
preformance.


Ok after that explanation is another one...
Before anything else happens Snormacs declares the "no-littering" package.
This package is also needed so that all of the Emacs junk files & other shit
don't clog up anything. If you want more info checkout the package.
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package no-littering
  :elpaca t
  :config
  (setq no-littering-etc-directory
      (expand-file-name ".config/" user-emacs-directory))
  (setq no-littering-var-directory
      (expand-file-name ".data/" user-emacs-directory)))
#+end_src
**** The real init
Next up I want to change some of Emac's basic functionalites to be more of what I like.
Numbers displayed to the left, tabs turned into spaces ect. Snormacs also loads elisp.el
which is the file that contains all of Snormacs' custom code/functions.
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (set-default-coding-systems 'utf-8)
  (add-to-list 'default-frame-alist '(font . "Comic Mono:9" )) ;; Sets font to Comic Mono (comment this line for default)
  (add-hook 'prog-mode-hook 'global-display-line-numbers-mode)
  (add-hook 'text-mode-hook 'visual-line-mode)

  (setq-default cursor-in-non-selected-windows nil)
  (setq indent-tabs-mode nil)
  (setq tab-width 2)

  (electric-pair-mode 1)
  (show-paren-mode 1) 

  (load "~/.emacs.d/lisp/elisp.el")
  ;;(load "~/.emacs.d/lisp/home.el") ;; Home.el is the EXWM configuration, commented out as I dont need it
#+end_src
**** Visuals
No one wants their editor to look like shit, what else can I say?

Ok theres a lot more to it.
- The Doom-Themes package will have all the themes you need so after declaration, declare your theme.
- Ivy is my completion framework which makes Snormacs look nice and not like it came out in Windows 8 era.
- Projectile makes Ivy less shit.
- Dashboard is the startup splash-screen, if dashboard isn't installed you'll just get an empty boring ass looking scratch buffer.
- Which-Key will keep you from going insane and having to remember every keybind you have in your configuration, which-key opens a tiny little buffer showing the prefixes of each keybind.
- Doom-Modeline will change that disgusting Emacs modeline into something that you can actually look at.
For those of you whom might not know, Emacs' modeline the the link at the bottom of the screen that displays
information.
- Rainbow-Mode will keep you sane when working with colors as it displays the color of a hex code on the hex code, isn't that neat?
- Fonts, 3 font packages required by other packages.
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package doom-themes
    :elpaca t
    :init (load-theme 'doom-tokyo-night t) ;; Palenight is my 2nd theme 
    :config
    (setq doom-themes-enable-bold t    
          doom-themes-enable-italic t))

  ;; Completion Setup
  (use-package ivy :elpaca t :init (ivy-mode))
  (use-package projectile :elpaca t)

  (use-package dashboard
    :elpaca t
    :after projectile
    :config
    (dashboard-setup-startup-hook)
    (setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*")))
    ;; Set the title
    (setq dashboard-banner-logo-title "Welcome to Snormacs")
    ;; Set the banner
    (setq dashboard-startup-banner "~/.emacs.d/.custom/.dashboard_logos/snorlax.txt")

    ;; Content is not centered by default. To center, set
    (setq dashboard-center-content t)
    (setq dashboard-show-shortcuts t)

    (setq dashboard-items '((recents  . 5)
                            (bookmarks . 5)
                            (projects . 5)
                            (agenda . 5)
                            (registers . 5)))

    (setq dashboard-icon-type 'all-the-icons) 
    (setq dashboard-display-icons-p t)
    (setq dashboard-icon-type 'nerd-icons)
    
    (setq dashboard-set-navigator t)
    (setq dashboard-set-init-info t)

    (setq dashboard-set-init-info t)
    (setq dashboard-set-footer t)
    (setq dashboard-footer-messages '("\“An idiot admires complexity, a genius admires simplicity\" - Terry A. Davis"))

    (setq dashboard-week-agenda t) ;; Org Agenda
    (setq dashboard-filter-agenda-entry 'dashboard-no-filter-agenda))

  (use-package which-key
    :elpaca t
    :config
    (setq which-key-idle-delay 0.2)
    :init (which-key-mode))
  (use-package beacon :elpaca t :init (beacon-mode))

  (use-package doom-modeline
    :elpaca t
    :init (doom-modeline-mode)
    :custom
    (doom-modeline-height 28)
    (doom-modeline-bar-width 6)

    (doom-modeline-env-version t)
    (doom-modeline-hud t)
    (doom-modeline-lsp t)
    (doom-modeline-github t)
    (doom-modeline-minor-modes nil)
    (doom-modeline-major-mode-icon t)
    (doom-modeline-enable-word-count t)
    (doom-modeline-buffer-file-name-style 'truncate-with-project))

  (use-package rainbow-mode :elpaca t :config (add-hook 'prog-mode-hook (lambda () (rainbow-mode))))

  ;; Remember to M-x all-the-icons-install-fonts & nerd-icons-install-fonts
  (use-package all-the-icons :elpaca t :if (display-graphic-p))
  (use-package nerd-icons :elpaca t)
  (use-package treemacs-all-the-icons :elpaca t :config (treemacs-load-theme "all-the-icons"))
#+end_src
