init.el
(defvar elpaca-installer-version 0.5)
(defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                              :ref nil
                              :files (:defaults (:exclude "extensions"))
                              :build (:not elpaca--activate-package)))
(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
       (build (expand-file-name "elpaca/" elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (< emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
        (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                 ((zerop (call-process "git" nil buffer t "clone"
                                       (plist-get order :repo) repo)))
                 ((zerop (call-process "git" nil buffer t "checkout"
                                       (or (plist-get order :ref) "--"))))
                 (emacs (concat invocation-directory invocation-name))
                 ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                       "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                 ((require 'elpaca))
                 ((elpaca-generate-autoloads "elpaca" repo)))
            (kill-buffer buffer)
          (error "%s" (with-current-buffer buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (load "./elpaca-autoloads")))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))

(elpaca elpaca-use-package
  (elpaca-use-package-mode)
  (setq elpaca-use-package-by-default t))
(elpaca-wait)

(use-package no-littering
:elpaca t
:config
(setq no-littering-etc-directory
    (expand-file-name ".config/" user-emacs-directory))
(setq no-littering-var-directory
    (expand-file-name ".data/" user-emacs-directory)))

(set-default-coding-systems 'utf-8)
(add-to-list 'default-frame-alist '(font . "Comic Mono:9" )) ;; Sets font to Comic Mono (comment this line for default)
(add-hook 'prog-mode-hook 'global-display-line-numbers-mode)
(add-hook 'text-mode-hook 'visual-line-mode)

(setq-default cursor-in-non-selected-windows nil)
(setq indent-tabs-mode nil)
(setq tab-width 2)

(load "~/.emacs.d/lisp/elisp.el")
;;(load "~/.emacs.d/lisp/home.el") ;; Home.el is the EXWM configuration, commented out as I dont need it

(use-package doom-themes
  :elpaca t
  :init (load-theme 'doom-tokyo-night t) ;; Palenight is my 2nd theme 
  :config
  (setq doom-themes-enable-bold t    
        doom-themes-enable-italic t))


(use-package ivy :elpaca t :init (ivy-mode))

(use-package projectile :elpaca t)

(use-package dashboard
  :elpaca t
  :after projectile
  :config
  (dashboard-setup-startup-hook)
  (setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*")))
  ;; Set the title
  (setq dashboard-banner-logo-title "Welcome to Snormacs")
  ;; Set the banner
  (setq dashboard-startup-banner "~/.emacs.d/.custom/.dashboard_logos/snorlax.txt")

  ;; Content is not centered by default. To center, set
  (setq dashboard-center-content t)
  (setq dashboard-show-shortcuts t)

  (setq dashboard-items '((recents  . 5)
                          (bookmarks . 5)
                          (projects . 5)
                          (agenda . 5)
                          (registers . 5)))

  (setq dashboard-icon-type 'all-the-icons) 
  (setq dashboard-display-icons-p t)
  (setq dashboard-icon-type 'nerd-icons)
  
  (setq dashboard-set-navigator t)
  (setq dashboard-set-init-info t)

  (setq dashboard-set-init-info t)
  (setq dashboard-set-footer t)
  (setq dashboard-footer-messages '("\“An idiot admires complexity, a genius admires simplicity\" - Terry A. Davis"))

  (setq dashboard-week-agenda t) ;; Org Agenda
  (setq dashboard-filter-agenda-entry 'dashboard-no-filter-agenda))

(use-package which-key
  :elpaca t
  :config
  (setq which-key-idle-delay 0.2)
  :init (which-key-mode))
(use-package beacon :elpaca t :init (beacon-mode))

(use-package doom-modeline
  :elpaca t
  :init (doom-modeline-mode)
  :custom
  (doom-modeline-height 28)
  (doom-modeline-bar-width 6)

  (doom-modeline-env-version t)
  (doom-modeline-hud t)
  (doom-modeline-lsp t)
  (doom-modeline-github t)
  (doom-modeline-minor-modes nil)
  (doom-modeline-major-mode-icon t)
  (doom-modeline-enable-word-count t)
  (doom-modeline-buffer-file-name-style 'truncate-with-project))

(use-package rainbow-mode :elpaca t :config (add-hook 'prog-mode-hook (lambda () (rainbow-mode))))

;; Remember to M-x all-the-icons-install-fonts & nerd-icons-install-fonts
(use-package all-the-icons :elpaca t :if (display-graphic-p))
(use-package nerd-icons :elpaca t)
(use-package treemacs-all-the-icons :elpaca t :config (treemacs-load-theme "all-the-icons"))
