init.el

(use-package calfw :elpaca t)
(use-package calfw-org
  :elpaca t
  :config
  (setq cfw:org-agenda-schedule-args '(:timestamp))) ;; TODO // Create calendar setup

(use-package typo :elpaca t :init (typo-global-mode 1))

(use-package magit :elpaca t)

(use-package perspective
  :elpaca t
  :custom
  (persp-mode-prefix-key (kbd "C-."))
  (persp-initial-frame-name "1")
  :init (persp-mode))

(use-package treemacs :elpaca t)
(use-package ranger
  :elpaca t
  :init (ranger-override-dired-mode t)
  :config
  (setq ranger-cleanup-eagerly t)
  (setq ranger-modify-header t)
  (setq ranger-show-hidden t))

(use-package multiple-cursors :elpaca t)
(use-package sudo-edit :elpaca t)
(use-package sudo-utils :elpaca t)
(use-package elcord :elpaca t :init (elcord-mode)) ;; Discord Status of Emacs

(use-package tree-sitter :elpaca t :init (global-tree-sitter-mode))
(use-package tree-sitter-langs :elpaca t)

(use-package lsp-mode
  :elpaca t
  :init (setq lsp-keymap-prefix "C-c l")
  (add-hook 'prog-mode-hook #'lsp)
  (add-hook 'lsp-mode #'lsp-enable-which-key-integration)
  :config
  (setq lsp-warn-no-matched-clients nil)
  :commands lsp)
;; Technically "Extra" LSP Packages
(use-package lsp-ui :elpaca t :commands lsp-ui-mode) 
(use-package lsp-ivy :elpaca t :commands lsp-ivy-workspace-symbol)
(use-package lsp-treemacs :elpaca t :commands lsp-treemacs-errors-list)
(use-package dap-mode :elpaca t)
(use-package company :elpaca t :config (add-hook 'prog-mode-hook #'global-company-mode))

(use-package paredit ;; The most useful shit for LISP (wraps parentheses & quotes)
  :elpaca t
  :init (autoload 'enable-paredit-mode "paredit" t)
  :config
  (add-hook 'emacs-lisp-mode-hook #'enable-paredit-mode)
  (add-hook 'eval-expression-minibuffer-setup-hook #'enable-paredit-mode)
  (add-hook 'ielm-mode-hook #'enable-paredit-mode)
  (add-hook 'lisp-mode-hook #'enable-paredit-mode)
  (add-hook 'lisp-interaction-mode-hook #'enable-paredit-mode)
  (add-hook 'scheme-mode-hook #'enable-paredit-mode)
  (add-hook 'yuck-mode-hook #'enable-paredit-mode))

(use-package geiser :elpaca t)
(use-package geiser-guile :elpaca t)
(use-package nim-mode :elpaca t)
(use-package nix-mode :elpaca t)
(use-package rust-mode :elpaca t :config (add-hook 'rust-mode-hook #'cargo-minor-mode))
(use-package cargo :elpaca t)

(use-package go-mode :elpaca t)
(use-package lua-mode :elpaca t)
(use-package haskell-mode :elpaca t)
(use-package zig-mode :elpaca t)

(use-package typescript-mode :elpaca t)
(use-package kotlin-mode :elpaca t)
(use-package yuck-mode :elpaca t)

(use-package go-translate
  :elpaca t
  :config
  (setq gts-translate-list '(("en" "ja") ("en" "es"))) ;; Add a longer list if you want to

  (setq gts-default-translator
        (gts-translator
         :picker (gts-prompt-picker)
         :engines (list (gts-bing-engine) (gts-google-engine))
         :render (gts-buffer-render))))
