init.el

(use-package general
  :elpaca t
  :config
  (general-evil-setup)
  (setq evil-want-keybinding nil)

  ;; Leader Keys Setup 
  (general-create-definer snor/leader-mappings-norm
    :states  'normal
    :keymaps 'override
    :prefix  ";") 

  (general-create-definer snor/leader-mappings-vis
    :states  'visual
    :keymaps 'override
    :prefix  ";")

  ;; Local-Leader Key  
  (general-create-definer snor/localleader-mappings-norm
    :states  'normal 
    :keymaps 'override
    :prefix  "SPC")

  ;; God Mode Setup
  (general-create-definer snor/GOD
    :keymaps 'override)

  ;; EXWM Setup
  (general-create-definer snor/exwm
    :states 'normal
    :keymaps 'override) 
  
  (snor/leader-mappings-norm
    ;; BUFFER MANAGEMENT
    "j"       '(:ignore t                 :wk "Buffer KeyChords")
    "j s"     '(switch-to-buffer          :wk "Switch to an Active Buffer")
    "j r"     '(revert-buffer             :wk "Reload Current Buffer")
    "j k"     '(kill-current-buffer       :wk "Kills Current Buffer")
    "j f"     '(ibuffer-list-buffers      :wk "List Buffers")
    "j <tab>" '(switch-to-prev-buffer     :wk "Switch to Previous Buffer")
    "j SPC"   '(switch-to-next-buffer     :wk "Switch to Next Buffer")

    ;; GOD MODE SETTINGS
    "g"       '(:ignore t                 :wk "GOD MODE MAPPINGS")
    "g g"     '(snor/evil-god-mode-all   :wk "SWITCH TO GOD MODE GLOBAL")
    "g l"     '(snor/evil-god-local-mode :wk "SWITCH TO GOD MODE BUFFER")
    "g j"     '(evil-execute-in-god-state :wk "EXECUTE CMD IN GOD STATE")
    "g ?"     '(snor/god-mode-manual     :wk "OPEN GOD MODE MANUAL")

    ;; Root
    "s"       '(:ignore t                 :wk "Options as Root")
    "s e"     '(sudo-edit                 :wk "Open Current File as Root")
    "s f"     '(sudo-edit-find-file       :wk "Find File as Root")

    ;; Org
    "o"       '(:ignore t                 :wk "Org Mode Options")
    "o df"    '(org-babel-tangle          :wk "Babel Tangle File")

    ;; MISC
    "f"       '(find-file                 :wk "Find & Open File"))

  (snor/leader-mappings-vis
    ;; Visual Mode Leader Mappings
    "d t" '(gts-do-translate              :wk "Translates Region"))

  (snor/localleader-mappings-norm
    ;; WINDOW MANAGEMENT
    "s"   '(:ignore t                 :wk "Split Windows Prefix")
    "s s" '(split-window-vertically   :wk "Split Window Vertically")
    "s h" '(split-window-horizontally :wk "Split Window Horizontally")

    "h"   '(windmove-left             :wk "Move Window Focus to the Left")
    "j"   '(windmove-down             :wk "Move Window Focus to the Down")
    "k"   '(windmove-up               :wk "Move Window Focus to the Up")
    "l"   '(windmove-right            :wk "Move Window Focus to the Right")

    "s k" '(delete-window             :wk "Delete Current Window")

		;; Calendar
		"c l" '(cfw:open-org-calendar     :wk "Launches Org-Calendar")

    ;; Misc
    "t" '(treemacs                     :wk "Toggle Treemacs")
    
    ;; Workspaces/Persp-Mode
    "<tab>"   '(:ignore t    :wk "Workspaces")

    "<tab> 1" '(snor/switch-to-workspace-01 :wk "Switch to Main Workspace")
    "<tab> 2" '(snor/switch-to-workspace-02 :wk "Switch to Workspace 2")
    "<tab> 3" '(snor/switch-to-workspace-03 :wk "Switch to Workspace 3")
    "<tab> 4" '(snor/switch-to-workspace-04 :wk "Switch to Workspace 4")
    "<tab> 5" '(snor/switch-to-workspace-05 :wk "Switch to Workspace 5")
    "<tab> 6" '(snor/switch-to-workspace-06 :wk "Switch to Workspace 6")
    "<tab> 7" '(snor/switch-to-workspace-07 :wk "Switch to Workspace 7")
    "<tab> 8" '(snor/switch-to-workspace-08 :wk "Switch to Workspace 8")
    "<tab> 9" '(snor/switch-to-workspace-09 :wk "Switch to Workspace 9")
    "<tab> 0" '(snor/switch-to-workspace-10 :wk "Switch to Workspace 10")

    "<tab> k" '(persp-next   :wk "Switch to Next Workspace")
    "<tab> j" '(persp-prev   :wk "Switch to Previous Workspace")
    "<tab> q" '(persp-kill   :wk "Kill Current Workspace"))

  (snor/GOD
    ;; Movement
    "C-1" '(backward-char             :wk "Move Backward")
    "C-2" '(next-line                 :wk "Move Down")
    "C-3" '(forward-char              :wk "Move Foward")
    "C-o" '(previous-line             :wk "Move Up")
    
    "C-4" '(move-end-of-line          :wk "Move to the End of the Line")
    "C-`" '(move-beginning-of-line    :wk "Move to the Start of the Line")
    
    "C-x" '(:ignore t                 :wk "Action Key Prefix")
    "C-W" '(move-beginning-of-line    :wk "Move to the Start of the Line")

    "C-?" '(snor/god-mode-manual    :wk "Opens God-Mode Manual")
    "C-;" '(snor/become-human       :wk "Return to Human State")))

(use-package evil
  :elpaca t
  :init (evil-mode)
  :config
  (setq-default tab-width 2)
  (setq-default evil-shift-width tab-width)

  (evil-define-key 'insert 'global (kbd "M-e") 'evil-normal-state)
  (evil-define-key 'god global-map [escape] 'evil-god-state-bail))
  ;; Extra stuff for Evil
  (use-package evil-god-state :elpaca t :after evil)
  (use-package evil-collection :elpaca t :after evil)

(use-package god-mode
  :elpaca t
  :after evil
  :config
  (setq god-exempt-major-modes nil)
  (setq god-exempt-predicates nil)
  (setq god-mode-enable-function-key-translation nil))

(use-package hydra :elpaca t)

(use-package org
  :elpaca t
  :init (org-mode)
  :config
  (evil-define-key 'normal 'global (kbd "<tab>") 'org-cycle)

  (setq org-startup-indented t)           
  (setq org-startup-with-inline-images t)
  (setq org-src-fontify-natively t))

(use-package org-roam :elpaca t :after org)

(use-package org-superstar 
  :elpaca t
  :after org-roam
  :config (add-hook 'org-mode-hook (lambda () (org-superstar-mode))))

(use-package org-present :elpaca t :after org-roam)

(custom-set-variables
;; custom-set-variables was added by Custom.
;; If you edit it by hand, you could mess it up, so be careful.
;; Your init file should contain only one such instance.
;; If there is more than one, they won't work right.
'(elcord-editor-icon "emacs_material_icon")
'(elcord-idle-message "Playing Melee...")
'(elcord-idle-timer 500)
'(elcord-quiet t)
'(elcord-refresh-rate 1)
'(warning-suppress-log-types
  '((org-element-cache)
    (org-element-cache)
    (org-element-cache)))
'(warning-suppress-types '((org-element-cache) (org-element-cache))))
